app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "release_year", "combined", "first", "year", "playcount", "fxg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Customer.create(email: song[0], first_name: song[1], last_name: song[2])